Repository: Techy-Wu/Let-s_Pick_UWP
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans, zh_hant

# AboutPage_LanguageNotFitNotice.Text
source: We are sorry but this page has not adapted to current language.
zh_hans: 很抱歉，此页面未适配当前语言
zh_hant: 抱歉，此介面未適配當前語言

# HomePage_AccelatingButton.Content
source: Accelating...
zh_hans: 加速中...
zh_hant: 加速中...

# HomePage_AutoStopSwitch_Header.Text
source: Automatically Stop
zh_hans: 自动停止
zh_hant: 自動停止

# HomePage_FinishButton.Content
source: Finished
zh_hans: 结束
zh_hant: 結束

# HomePage_PickButton.Content
source: Pick!
zh_hans: 抽取!
zh_hant: 抽取！

# HomePage_Seed.Text
source: Seed
zh_hans: 种子
zh_hant: 種子

# HomePage_Showing.Text
source: Group
zh_hans: 组
zh_hant: 組

# HomePage_StopButton.Content
source: Stop!
zh_hans: 停止!
zh_hant: 停止！

# HomePage_TargetNumberBox_Header.Text
source: Target Amount
zh_hans: 目标数量
zh_hant: 目標數量

# MainPage_About.Content
source: About
zh_hans: 关于
zh_hant: 關於

# MainPage_Home.Content
source: Home Page
zh_hans: 主页
zh_hant: 首頁

# MainPage_Open.Content
source: Open Source File
zh_hans: 打开资源文件
zh_hant: 打開訊息檔案

# MainPage_Reload.Content
source: Refresh
zh_hans: 刷新页面
zh_hant: 刷新介面

# MainPage_Save.Content
source: Save the Result to File
zh_hans: 保存结果到文件
zh_hant: 保存結果至檔案

# MainPage_Settings.Content
source: Settings
zh_hans: 设置
zh_hant: 設定

# SettingPage_AdvancedDescription.Text
source: Advanced
zh_hans: 高级
zh_hant: 高等

# SettingPage_AutoStop.Header
source: Automatically Stop
zh_hans: 自动停止
zh_hant: 自動停止

# SettingPage_ImportSettings.Text
source: Import settings from storage
zh_hans: 从文件导入设置
zh_hant: 從檔案導入設置

# SettingPage_Language.Text
source: Language / 语言
zh_hans: 语言 / Language
zh_hant: 語言 / Language

# SettingPage_ListDescription.Text
source: Group
zh_hans: 组
zh_hant: 組

# SettingPage_PickingDescription.Text
source: While Picking
zh_hans: 抽取时
zh_hant: 抽取时

# SettingPage_RandomSeed_Info.Text
source: The random seed would automatically update while opening the homepage no matter it is visible or not
zh_hans: 无论是否显示随机数种子，随机数种子都将在每次打开主页时自动更新
zh_hant: 無論是否啓用監視，亂數種子都將在每次打開首頁時自動更新

# SettingPage_RandSeed_Visible_Switch.Header
source: Display Random Seed
zh_hans: 显示随机数种子
zh_hant: 監視亂數種子

# SettingPage_RestartButton.Content
source: Restart
zh_hans: 重启
zh_hant: 重啓

# SettingPage_RestartInfo.Text
source: You need to restart the application to apply the new language
zh_hans: 你需要重启应用程序以应用新的语言
zh_hant: 你需要重啓應用程式以應用新的語言

# SettingPage_Surface.Text
source: User Interface (UI)
zh_hans: 界面
zh_hant: 介面

# SettingPage_TickSet.Header
source: Automatically Stop Counter (Tick)
zh_hans: 自动停止计数 (Tick)
zh_hant: 自動停止計數 (Tick)

# SettingPage_ToolBar_Background_Switch.Header
source: Toolbar Background
zh_hans: 工具栏背景
zh_hant: 工具欄背景

# SettingPage_RandMethod_Selector.Header
source: Random Dependence
zh_hans: 随机数依赖源
zh_hant: 亂數提供

# rand_dependence_1.Text
source: Time Formated to MMDD-Min-Sec-Hour
zh_hans: 月日分秒时格式时间
zh_hant: 月日分秒時格式時間

# rand_dependence_2.Text
source: Time Unix Epoch (Tick) Value
zh_hans: 时间戳(Tick)值
zh_hant: 時間戳(Tick)值

# rand_dependence_3.Text
source: 1st Result of Time Formated to MMDD-Min-Sec-Hour
zh_hans: 依赖月日分秒时格式时间生成的第一个随机数
zh_hant: 依賴月日分秒時格式時間生成的第一個亂數

# rand_dependence_4.Text
source: 1st Result of Unix Epoch (Tick) Value
zh_hans: 依赖时间戳(Tick)值生成的第一个随机数
zh_hant: 依賴時間戳(Tick)值生成的第一個亂數

# SettingPage_ToolBar_Foreground_Switch.Header
source: Retain Toolbar Foreground Black
zh_hans: 保持工具栏黑色前景色
zh_hant: 保留工具欄黑色前景色

# HomePage_ProcessingButton.Content
source: Processing...
zh_hans: 处理中...
zh_hant: 處理中...

# SettingPage_Pre_Caculate_Switch.Header
source: Pre Release
zh_hans: 预生成
zh_hant: 預生成

# SettingPage_Pseudorandom_Notice.Text
source: The current method would lead to a Pseudorandom
zh_hans: 当前方式将产生伪随机数
zh_hant: 當前途徑將產生僞亂數

# rand_dependence_5.Text
source: Cryptographic Random Number Generator (RNG)
zh_hans: 加密随机数生成器 (RNG)
zh_hant: 全域唯一識別項 (GUID)

# rand_dependence_6.Text
source: Globally Unique Identifier (GUID)
zh_hans: 全局唯一标识符 (GUID)
zh_hant: 實作密碼編譯亂數產生器 (RNG)

# SettingPage_Variable_Seed_Switch.Header
source: Variable Seed
zh_hans: 动态种子
zh_hant: 動態種子

# MainPage_UpdateTip.Text
source: New version found : %a\nCurrent version : %b\nPlease open About Page to consult the latest version
zh_hans: 发现新版本：%a\n当前版本：%b\n请移步关于页面查看更新
zh_hant: 發現新版本：%a\n當前版本：%b\n請關注關於界面瞭解更新

# SettingPage_Update.Text
source: Update
zh_hans: 更新
zh_hant: 更新

# SettingPage_UpdateSearchTimeout.Header
source: Search Update Timeout (ms)
zh_hans: 检查更新超时 (ms)
zh_hant: 檢查更新超時 (ms)

# HomePage_RandomNumber_Requesting.Text
source: Requesting natural random numbers from random.org
zh_hans: 正在向 random.org 请求真随机数
zh_hant: 正在向 random.org 請求自然隨機數

# rand_dependence_7.Text
source: Directly from random.org
zh_hans: 直接从 random.org 获取
zh_hant: 直接從 random.org 獲取

# HomePage_RandomNumber_RandomIO_Label.Text
source: Random numbers from random.org, No seed
zh_hans: 随机数来自 random.org, 无种子
zh_hant: 隨機數來自 random.org, 無種子

# AboutPage_CoderLabel.Text
source: Coded by
zh_hans: 编程

# AboutPage_Declaration.Text
source: Declaration
zh_hans: 声明

# AboutPage_DesignerLabel.Text
source: Designed by
zh_hans: 企划

# AboutPage_SupportSiteRefferenceNotification.Text
source: Browse our website for any available supports.
zh_hans: 请浏览我们的支持网站以获取更多帮助。

# AboutPage_SupportURLLabel.Text
source: Support Site
zh_hans: 支持网站

# AboutPage_VersionLabel.Text
source: Version
zh_hans: 版本

# AboutPage_DeclarationMicrosoftCopyright.Text
source: Windows 10，Winform，UWP and Universal Windows Platform are trademarks of Microsoft Corporation.
zh_hans: Windows 10，Winform，UWP 和 Universal Windows Platform 是 Microsoft Corporation 的商标。

# AboutPage_DeclarationMyCopyright.Text
source: This software is protected under the international laws and regulations on intellectual property. For details please refer to https://techy-wu.github.io/Let-s_Pick_UWP/blog/2021/02/08/copyright/
zh_hans: 本软件受国际知识产权法律法规保护，详见 https://techy-wu.github.io/Let-s_Pick_UWP/blog/2021/02/08/copyright/

# AboutPage_DeclarationOthersCopyright.Text
source: Corporation names, production names or service names of other corporations mentioned in this software are trademarks of these corporations.
zh_hans: 本软件提及的其它公司名称、产品名称及服务名称均为其它公司各自的商标。

# AboutPage_UpdateAndManualNote.Text
source: For software and usage manuals, please refer to https://techy-wu.github.io/Let-s_Pick_UWP/
zh_hans: 获取软件更新及使用说明请关注网站 https://techy-wu.github.io/Let-s_Pick_UWP/
